In [34]:
import pandas as pd

In [35]:
distance_from_sun = [149.6, 1433.5, 227.9, 108.2, 778.6]

In [36]:
planets = ['Earth','Saturn', 'Mars','Venus', 'Jupiter']

In [37]:
distance_planets = pd.Series(data = distance_from_sun, index = planets)
distance_planets

Earth       149.6
Saturn     1433.5
Mars        227.9
Venus       108.2
Jupiter     778.6
dtype: float64

In [38]:
time_light = distance_planets /18
time_light

Earth       8.311111
Saturn     79.638889
Mars       12.661111
Venus       6.011111
Jupiter    43.255556
dtype: float64

In [39]:
planets = distance_planets /18
planets

Earth       8.311111
Saturn     79.638889
Mars       12.661111
Venus       6.011111
Jupiter    43.255556
dtype: float64

In [40]:
close_planets = time_light[time_light < 40] 
close_planets

Earth     8.311111
Mars     12.661111
Venus     6.011111
dtype: float64

In [41]:
distance_from_sun = {'Bob' : pd.Series([149.6, 1433.5, 227.9, 108.2, 778.6], index=['Earth','Saturn', 'Mars','Venus', 'Jupiter']), 
'Alice' : pd.Series([3,  4, 5, 6, 7], index=['pluto', 'darth', 'backham', 'dubi', 'alsa'])}

type(distance_from_sun)

dict

In [42]:
Planet_data = pd.DataFrame(distance_from_sun)
Planet_data

            Bob  Alice
Earth     149.6    NaN
Jupiter   778.6    NaN
Mars      227.9    NaN
Saturn   1433.5    NaN
Venus     108.2    NaN
alsa        NaN    7.0
backham     NaN    5.0
darth       NaN    4.0
dubi        NaN    6.0
pluto       NaN    3.0

In [43]:
distance_from_sun = {'Bob' : pd.Series([149.6, 1433.5, 227.9, 108.2, 778.6]),  
'Alice' : pd.Series(['dude', 8, 5, 6, 7])}

df = pd.DataFrame(distance_from_sun)
df

      Bob Alice
0   149.6  dude
1  1433.5     8
2   227.9     5
3   108.2     6
4   778.6     7

In [48]:
Planet_data.index

Index(['Earth', 'Jupiter', 'Mars', 'Saturn', 'Venus', 'alsa', 'backham',
       'darth', 'dubi', 'pluto'],
      dtype='object')

In [49]:
Planet_data.columns

Index(['Bob', 'Alice'], dtype='object')

In [50]:
Planet_data.values

array([[ 149.6,    nan],
       [ 778.6,    nan],
       [ 227.9,    nan],
       [1433.5,    nan],
       [ 108.2,    nan],
       [   nan,    7. ],
       [   nan,    5. ],
       [   nan,    4. ],
       [   nan,    6. ],
       [   nan,    3. ]])

In [52]:
Planet_data.shape

(10, 2)

In [53]:
Planet_data.size

20

In [54]:
Planet_data.ndim

2

In [62]:
Planet_data = pd.DataFrame(Planet_data, index=[earth, Jupyter])

NameError: name 'earth' is not defined

In [70]:
data = {'Intergers' : [1, 2, 3] , 
        'Floats' : [4.5, 8.3, 9.6]}

df = pd.DataFrame(data, index=['label 1', 'label 2', 'label 3'])
df

         Intergers  Floats
label 1          1     4.5
label 2          2     8.3
label 3          3     9.6